In [1]:
import pandas as pd

In [2]:
filepath = "movies_metadata.csv"

In [3]:
# Create a dataframe from csv
df = pd.read_csv(filepath, delimiter=',')
# User list comprehension to create a list of lists from Dataframe rows
list_of_rows = [list(row) for row in df.values]
type(list_of_rows)

C:\Users\Walte\.conda\envs\PythonData\lib\site-packages\IPython\core\interactiveshell.py:3072: DtypeWarning: Columns (10) have mixed types.Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

list

In [4]:
#Check cell 3,3 to check 'genre' information..
print(list_of_rows[3][3])

[{'id': 35, 'name': 'Comedy'}, {'id': 18, 'name': 'Drama'}, {'id': 10749, 'name': 'Romance'}]

In [5]:
#Check length of list - matches excel total number of movies.
print(len(list_of_rows))

45466

In [6]:
#String has to be converted into list of dictionaries
# found eval function on internet...seems to work.

jd = eval(list_of_rows[3][3])
print(jd)

[{'id': 35, 'name': 'Comedy'}, {'id': 18, 'name': 'Drama'}, {'id': 10749, 'name': 'Romance'}]

In [7]:
#Try with another row..
jd2 = eval(list_of_rows[4][3])
print(jd2)

[{'id': 35, 'name': 'Comedy'}]

In [8]:
# add movie id number to what will be the genre dataframe.
df = pd.DataFrame(jd)
df['movie'] = list_of_rows[3][5]
df

      id     name  movie
0     35   Comedy  31357
1     18    Drama  31357
2  10749  Romance  31357

In [9]:
# Combine dataframes using the concat method..testing with just the two dataframes..

df2 = pd.DataFrame(jd2)
df2['movie'] = list_of_rows[4][5]
frames = [df,df2]
df3 = pd.concat(frames, sort=False)
df3

      id     name  movie
0     35   Comedy  31357
1     18    Drama  31357
2  10749  Romance  31357
0     35   Comedy  11862

In [10]:
# Run a loop for all rows in the spreadsheet. 
#   convert the string in column[3] to python list of dictionaries
#   cabsreate new dataframe from genre information in each row
#   add movie id number from column[5] to dataframe
#   append to a list of dataframes to be concatenated outside the loop.
# Concatenate to one dataframe all the genre information with movie id. Reset index.

list_of_genre_dataframes = []
for row in list_of_rows:
    #print(row[3], row[5])
    genre_list = eval(row[3])
    record_df = pd.DataFrame(genre_list)
    record_df['movie_id_number'] = row[5]
    list_of_genre_dataframes.append(record_df)

genre_table = pd.concat(list_of_genre_dataframes, sort=False)
genre_table.reset_index(inplace=True, drop=True)
genre_table.head(30)

         id       name movie_id_number
0      16.0  Animation             862
1      35.0     Comedy             862
2   10751.0     Family             862
3      12.0  Adventure            8844
4      14.0    Fantasy            8844
5   10751.0     Family            8844
6   10749.0    Romance           15602
7      35.0     Comedy           15602
8      35.0     Comedy           31357
9      18.0      Drama           31357
10  10749.0    Romance           31357
11     35.0     Comedy           11862
12     28.0     Action             949
13     80.0      Crime             949
14     18.0      Drama             949
15     53.0   Thriller             949
16     35.0     Comedy           11860
17  10749.0    Romance           11860
18     28.0     Action           45325
19     12.0  Adventure           45325
20     18.0      Drama           45325
21  10751.0     Family           45325
22     28.0     Action            9091
23     12.0  Adventure            9091
24     53.0   Thriller            9091
25     12.0  Adventure             710
26     28.0     Action             710
27     53.0   Thriller             710
28     35.0     Comedy            9087
29     18.0      Drama            9087